trade_exp/src/Reports/ЗадолженностьКлиентов/ЗадолженностьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="43424a3a-c495-41ec-9fe8-bf50d705b4fe">
  <name>ЗадолженностьКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

trade_exp/src/InformationRegisters/ПартнерыСегмента/ПартнерыСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПартнерыСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ВариантыКонтроляОплатыКлиентом/ВариантыКонтроляОплатыКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="afe1cdf6-e085-4a86-8fd7-bf64e6bd53e8">
  <name>ВариантыКонтроляОплатыКлиентом</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e822f82c-ea35-4145-94c1-bd2f840b2f7c">
    <name>АвансДоОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="753edf13-a7d2-458e-bef8-b570e82e62d5">
    <name>ПредоплатаДоОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="94a0de53-2be3-4284-8b7e-c90da0ffa2df">
    <name>КредитПослеОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1c47debd-cd2a-4909-9ef7-bb4bf55f723e">
    <name>КредитСдвиг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
  </predefined>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаАктивна</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаАктивацииБонуснойПрограммы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПИН_Код</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2d8cff6-485d-4179-8e9c-c0e74d4f7704">
    <name>АктивнаяФаза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ed10a1b-4743-4b2e-b332-43a49c33d53a">
    <name>ОбъемСтроительства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d937f9b-c6c0-400a-a976-e17d07dc2cf4">
    <name>ДатаНачалаАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ab7b5f85-1360-48d2-9266-6d9b809fa216">
    <name>НормативПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПодтвержденияНомераТелефона</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНомераТелефона</name>
    <type>
      <types>EnumRef.СостояниеНомераТелефона</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойОборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="63694e17-0adb-4a8a-afea-e4e7735edfc1">
    <name>СоглашениеДляРассылок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf121ead-3982-46d0-bcce-a08413595a1f">
    <name>Парсинг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="59343292-e18c-4609-a039-11cc8d8cd93a">
    <name>ВидыНоменклатурыАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="eeb4daa7-609a-4968-8745-1b6125400c0b">
      <name>ВидНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f09dd5d-7de9-4a21-a839-9674c6120b36">
      <name>Коэффициент</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e8a1213f-80cf-4cf1-866d-59ee4fa4ffbe">
      <name>ЭтапСтроительства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0daacbf9-aa02-4485-a535-d2d28b00523c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8667b665-ede0-456e-ad08-51f4cf43503a">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6203050a-d3b4-4e82-89f7-5ad54cf4906b">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3b79728c-4ce5-4330-b398-b32f0bb3e6d5">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9e943c2-8fad-47c5-b878-66f2576cc609">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2ac6cdc9-f345-456a-9bd8-2e5ae5af6f56">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6245a898-0f24-4b85-b2d7-89831867e9d9">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9d10a2ad-841d-4931-902b-83db2a08aaaa">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2acd53d1-e5ab-4fe9-8341-24b714c87f11">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e30e3544-d00d-4269-ac29-88451a763262">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="675d6c69-31a6-49c2-a9b2-cc82f578bbeb">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce03862f-daeb-4d43-a69d-c989cd1f6089">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72399ba5-bcbe-40be-b76e-ff36467bc65d">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="df571c83-e6f9-459f-abbc-6e6053e6eb48">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Reports/ЗадолженностьКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("ПриКомпоновкеРезультата")
Процедура Док_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	
	// Сформируем отчет
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	#Удаление 
	ТекстЗапроса = ТекстЗапроса();
	#КонецУдаления
	
	#Вставка
	ТекстЗапроса = ТекстЗапросаМодификация(НастройкиОтчета);
	#КонецВставки 
	ВзаиморасчетыСервер.ДобавитьОтборыВыбранныхПолейВЗапрос(ТекстЗапроса, НастройкиОтчета, СхемаКомпоновкиДанных.ВычисляемыеПоля, "Расчеты");
	
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос = ТекстЗапроса;
	
	#Вставка
	ИзменитьВычисляемоеПоле(СхемаКомпоновкиДанных,НастройкиОтчета);
    #КонецВставки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	//Предупреждение о невыполенном распределении взаиморасчетов.
	ВзаиморасчетыСервер.ВывестиПредупреждениеОбОбновлении(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаМодификация(вариант)
	
	если типзнч(вариант.ДополнительныеСвойства)=тип("Структура") и вариант.ДополнительныеСвойства.КлючВарианта="ЗадолженностьКлиентовПричиныЗапретаОтгрузки"  тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Расчеты.Организация КАК Организация,
		               |	Расчеты.Партнер КАК Партнер,
		               |	Расчеты.Контрагент КАК Контрагент,
		               |	Расчеты.Договор КАК Договор,
		               |	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельности,
		               |	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		               |	Расчеты.Валюта КАК Валюта,
		               |	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
		               |	Расчеты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
		               |	Расчеты.ДатаВозникновения КАК ДатаВозникновения,
		               |	СУММА(Расчеты.НашДолг) КАК НашДолг,
		               |	СУММА(Расчеты.ДолгКлиента) КАК ДолгКлиента,
		               |	СУММА(Расчеты.ДолгКлиентаПросрочено) КАК ДолгКлиентаПросрочено,
		               |	СУММА(Расчеты.ПлановаяОплатаАванс) КАК ПлановаяОплатаАванс,
		               |	СУММА(Расчеты.ПлановаяОплатаПредоплата) КАК ПлановаяОплатаПредоплата,
		               |	СУММА(Расчеты.ПлановаяОплатаКредит) КАК ПлановаяОплатаКредит,
		               |	СУММА(Расчеты.ПлановаяОплатаПросрочено) КАК ПлановаяОплатаПросрочено,
		               |	СУММА(Расчеты.Оплачивается) КАК Оплачивается,
		               |	СУММА(Расчеты.ПлановаяОтгрузка) КАК ПлановаяОтгрузка,
		               |	СУММА(Расчеты.ПлановаяОтгрузкаПросрочено) КАК ПлановаяОтгрузкаПросрочено,
		               |	СУММА(Расчеты.Отгружается) КАК Отгружается
		               |ПОМЕСТИТЬ ВтРасчеты
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		АналитикаУчета.Организация КАК Организация,
		               |		АналитикаУчета.Партнер КАК Партнер,
		               |		АналитикаУчета.Контрагент КАК Контрагент,
		               |		АналитикаУчета.Договор КАК Договор,
		               |		АналитикаУчета.НаправлениеДеятельности КАК НаправлениеДеятельности,
		               |		РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
		               |		РасчетыПоСрокам.Валюта КАК Валюта,
		               |		РасчетыПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
		               |		РасчетыПоСрокам.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
		               |		РасчетыПоСрокам.ДатаВозникновения КАК ДатаВозникновения,
		               |		РасчетыПоСрокам.ПредоплатаОстаток КАК НашДолг,
		               |		РасчетыПоСрокам.ДолгОстаток КАК ДолгКлиента,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоСрокам.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕНЬ)
		               |				ТОГДА РасчетыПоСрокам.ДолгОстаток
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК ДолгКлиентаПросрочено,
		               |		0 КАК ПлановаяОплатаАванс,
		               |		0 КАК ПлановаяОплатаПредоплата,
		               |		0 КАК ПлановаяОплатаКредит,
		               |		0 КАК ПлановаяОплатаПросрочено,
		               |		0 КАК Оплачивается,
		               |		0 КАК ПлановаяОтгрузка,
		               |		0 КАК ПлановаяОтгрузкаПросрочено,
		               |		0 КАК Отгружается
		               |	ИЗ
		               |		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&ДатаОтчетаГраница, ) КАК РасчетыПоСрокам
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		               |			ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		               |	ГДЕ
		               |		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		               |	{ГДЕ
		               |		АналитикаУчета.Организация.* КАК Организация,
		               |		АналитикаУчета.Партнер.* КАК Партнер,
		               |		АналитикаУчета.Контрагент.* КАК Контрагент,
		               |		АналитикаУчета.Договор.* КАК Договор,
		               |		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		               |		(АналитикаУчета.Партнер В
		               |				(ВЫБРАТЬ
		               |					ОтборПоСегментуПартнеров.Партнер
		               |				ИЗ
		               |					ОтборПоСегментуПартнеров
		               |				ГДЕ
		               |					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)) КАК Поле2}
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		АналитикаУчета.Организация,
		               |		АналитикаУчета.Партнер,
		               |		АналитикаУчета.Контрагент,
		               |		АналитикаУчета.Договор,
		               |		АналитикаУчета.НаправлениеДеятельности,
		               |		РасчетыСКлиентами.ОбъектРасчетов,
		               |		РасчетыСКлиентами.Валюта,
		               |		ВЫБОР
		               |			КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |				ТОГДА РасчетыСКлиентами.Регистратор
		               |			ИНАЧЕ РасчетыСКлиентами.ПродажаПоЗаказу
		               |		КОНЕЦ,
		               |		ДАТАВРЕМЯ(1, 1, 1),
		               |		ДАТАВРЕМЯ(1, 1, 1),
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		СУММА(ВЫБОР
		               |				КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |					ТОГДА РасчетыСКлиентами.Отгружается
		               |				ИНАЧЕ -РасчетыСКлиентами.Отгружается
		               |			КОНЕЦ)
		               |	ИЗ
		               |		РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		               |			ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		               |	ГДЕ
		               |		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		               |		И РасчетыСКлиентами.Отгружается <> 0
		               |	{ГДЕ
		               |		АналитикаУчета.Организация.* КАК Организация,
		               |		АналитикаУчета.Партнер.* КАК Партнер,
		               |		АналитикаУчета.Контрагент.* КАК Контрагент,
		               |		АналитикаУчета.Договор.* КАК Договор,
		               |		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		               |		(АналитикаУчета.Партнер В
		               |				(ВЫБРАТЬ
		               |					ОтборПоСегментуПартнеров.Партнер
		               |				ИЗ
		               |					ОтборПоСегментуПартнеров
		               |				ГДЕ
		               |					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)) КАК Поле2}
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		АналитикаУчета.Организация,
		               |		АналитикаУчета.Партнер,
		               |		АналитикаУчета.Контрагент,
		               |		АналитикаУчета.Договор,
		               |		АналитикаУчета.НаправлениеДеятельности,
		               |		РасчетыСКлиентами.ОбъектРасчетов,
		               |		РасчетыСКлиентами.Валюта,
		               |		ВЫБОР
		               |			КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |				ТОГДА РасчетыСКлиентами.Регистратор
		               |			ИНАЧЕ РасчетыСКлиентами.ПродажаПоЗаказу
		               |		КОНЕЦ
		               |	
		               |	ИМЕЮЩИЕ
		               |		СУММА(ВЫБОР
		               |				КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |					ТОГДА РасчетыСКлиентами.Отгружается
		               |				ИНАЧЕ -РасчетыСКлиентами.Отгружается
		               |			КОНЕЦ) <> 0) КАК Расчеты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Расчеты.Организация,
		               |	Расчеты.Партнер,
		               |	Расчеты.Контрагент,
		               |	Расчеты.Договор,
		               |	Расчеты.НаправлениеДеятельности,
		               |	Расчеты.ОбъектРасчетов,
		               |	Расчеты.Валюта,
		               |	Расчеты.РасчетныйДокумент,
		               |	Расчеты.ДатаПлановогоПогашения,
		               |	Расчеты.ДатаВозникновения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Расчеты.Организация КАК Организация,
		               |	Расчеты.Партнер КАК Партнер,
		               |	Расчеты.Контрагент КАК Контрагент,
		               |	Расчеты.Договор КАК Договор,
		               |	Расчеты.НаправлениеДеятельности КАК НаправлениеДеятельности,
		               |	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		               |	Расчеты.Валюта КАК Валюта,
		               |	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
		               |	Расчеты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
		               |	Расчеты.ДатаВозникновения КАК ДатаВозникновения,
		               |	Расчеты.НашДолг КАК НашДолг,
		               |	Расчеты.ДолгКлиента КАК ДолгКлиента,
		               |	Расчеты.ДолгКлиентаПросрочено КАК ДолгКлиентаПросрочено,
		               |	Расчеты.ПлановаяОплатаАванс КАК ПлановаяОплатаАванс,
		               |	Расчеты.ПлановаяОплатаПредоплата КАК ПлановаяОплатаПредоплата,
		               |	Расчеты.ПлановаяОплатаКредит КАК ПлановаяОплатаКредит,
		               |	Расчеты.ПлановаяОплатаПросрочено КАК ПлановаяОплатаПросрочено,
		               |	Расчеты.Оплачивается КАК Оплачивается,
		               |	Расчеты.ПлановаяОтгрузка КАК ПлановаяОтгрузка,
		               |	Расчеты.ПлановаяОтгрузкаПросрочено КАК ПлановаяОтгрузкаПросрочено,
		               |	ВЫБОР
		               |		КОГДА Расчеты.НашДолг + Расчеты.ДолгКлиента = 0
		               |			ТОГДА Расчеты.Отгружается
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Отгружается,
		               |	ЕСТЬNULL(Договоры.ЗапрещаетсяПросроченнаяЗадолженность, ЛОЖЬ) КАК ЗапрещаетсяПросроченнаяЗадолженность,
		               |	ЕСТЬNULL(Договоры.ОграничиватьСуммуЗадолженности, ЛОЖЬ) КАК ОграничиватьСуммуЗадолженности,
		               |	ЕСТЬNULL(Договоры.ДопустимаяСуммаЗадолженности, 0) КАК ДопустимаяСуммаЗадолженности
		               |ИЗ
		               |	ВтРасчеты КАК Расчеты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		               |		ПО (Договоры.Ссылка = Расчеты.Договор)";
		
	иначе
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Сегменты.Партнер КАК Партнер,
		|	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
		|ПОМЕСТИТЬ ОтборПоСегментуПартнеров
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК Сегменты
		|{ГДЕ
		|	Сегменты.Сегмент.* КАК СегментПартнеров,
		|	Сегменты.Партнер.* КАК Партнер}
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партнер,
		|	ИспользуетсяОтборПоСегментуПартнеров
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.Организация                       КАК Организация,
		|	Расчеты.Партнер                           КАК Партнер,
		|	Расчеты.Контрагент                        КАК Контрагент,
		|	Расчеты.Договор                           КАК Договор,
		|	Расчеты.НаправлениеДеятельности           КАК НаправлениеДеятельности,
		|	Расчеты.ОбъектРасчетов                    КАК ОбъектРасчетов,
		|	Расчеты.Валюта                            КАК Валюта,
		|	Расчеты.РасчетныйДокумент                 КАК РасчетныйДокумент,
		|	Расчеты.ДатаПлановогоПогашения            КАК ДатаПлановогоПогашения,
		|	Расчеты.ДатаВозникновения                 КАК ДатаВозникновения,
		|	СУММА(Расчеты.НашДолг)                    КАК НашДолг,
		|	СУММА(Расчеты.ДолгКлиента)                КАК ДолгКлиента,
		|	СУММА(Расчеты.ДолгКлиентаПросрочено)      КАК ДолгКлиентаПросрочено,
		|	
		|	СУММА(Расчеты.ПлановаяОплатаАванс)        КАК ПлановаяОплатаАванс,
		|	СУММА(Расчеты.ПлановаяОплатаПредоплата)   КАК ПлановаяОплатаПредоплата,
		|	СУММА(Расчеты.ПлановаяОплатаКредит)       КАК ПлановаяОплатаКредит,
		|	СУММА(Расчеты.ПлановаяОплатаПросрочено)   КАК ПлановаяОплатаПросрочено,
		|	СУММА(Расчеты.Оплачивается)               КАК Оплачивается,
		|	
		|	СУММА(Расчеты.ПлановаяОтгрузка)           КАК ПлановаяОтгрузка,
		|	СУММА(Расчеты.ПлановаяОтгрузкаПросрочено) КАК ПлановаяОтгрузкаПросрочено,
		|	СУММА(Расчеты.Отгружается)                КАК Отгружается
		|ПОМЕСТИТЬ ВтРасчеты
		|ИЗ (
		|	ВЫБРАТЬ
		|		АналитикаУчета.Организация                                     КАК Организация,
		|		АналитикаУчета.Партнер                                         КАК Партнер,
		|		АналитикаУчета.Контрагент                                      КАК Контрагент,
		|		АналитикаУчета.Договор                                         КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
		|		РасчетыПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
		|		РасчетыПоСрокам.Валюта                                         КАК Валюта,
		|		РасчетыПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
		|		РасчетыПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
		|		РасчетыПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
		|		РасчетыПоСрокам.ПредоплатаОстаток                              КАК НашДолг,
		|		РасчетыПоСрокам.ДолгОстаток                                    КАК ДолгКлиента,
		|		ВЫБОР 
		|			КОГДА РасчетыПоСрокам.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДатаОтчета,ДЕНЬ)
		|				ТОГДА РасчетыПоСрокам.ДолгОстаток
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                          КАК ДолгКлиентаПросрочено,
		|		
		|		0                                                              КАК ПлановаяОплатаАванс,
		|		0                                                              КАК ПлановаяОплатаПредоплата,
		|		0                                                              КАК ПлановаяОплатаКредит,
		|		0                                                              КАК ПлановаяОплатаПросрочено,
		|		0                                                              КАК Оплачивается,
		|		
		|		0                                                              КАК ПлановаяОтгрузка,
		|		0                                                              КАК ПлановаяОтгрузкаПросрочено,
		|		0                                                              КАК Отгружается
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&ДатаОтчетаГраница) КАК РасчетыПоСрокам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		|				ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		|	ГДЕ
		|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|	{ГДЕ
		|		АналитикаУчета.Организация.* КАК Организация,
		|		АналитикаУчета.Партнер.* КАК Партнер,
		|		АналитикаУчета.Контрагент.* КАК Контрагент,
		|		АналитикаУчета.Договор.* КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		|		(АналитикаУчета.Партнер В
		|				(ВЫБРАТЬ
		|					ОтборПоСегментуПартнеров.Партнер
		|				ИЗ
		|					ОтборПоСегментуПартнеров
		|				ГДЕ
		|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АналитикаУчета.Организация                                    КАК Организация,
		|		АналитикаУчета.Партнер                                        КАК Партнер,
		|		АналитикаУчета.Контрагент                                     КАК Контрагент,
		|		АналитикаУчета.Договор                                        КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности                        КАК НаправлениеДеятельности,
		|		РасчетыПланОплат.ОбъектРасчетов                               КАК ОбъектРасчетов,
		|		РасчетыПланОплат.Валюта                                       КАК Валюта,
		|		РасчетыПланОплат.ДокументПлан                                 КАК ДокументПлан,
		|		РасчетыПланОплат.ДатаПлановогоПогашения                       КАК ДатаПлановогоПогашения,
		|		РасчетыПланОплат.ДатаВозникновения                            КАК ДатаВозникновения,
		|		0                                                             КАК НашДолг,
		|		0                                                             КАК ДолгКлиента,
		|		0                                                             КАК ДолгКлиентаПросрочено,
		|		
		|		ВЫБОР
		|			КОГДА РасчетыПланОплат.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения)
		|				ТОГДА РасчетыПланОплат.КОплатеОстаток 
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                         КАК ПлановаяОплатаАванс,
		|		ВЫБОР
		|			КОГДА РасчетыПланОплат.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки)
		|				ТОГДА РасчетыПланОплат.КОплатеОстаток 
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                         КАК ПлановаяОплатаПредоплата,
		|		ВЫБОР
		|			КОГДА РасчетыПланОплат.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки)
		|				ИЛИ РасчетыПланОплат.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.КредитСдвиг)
		|				ТОГДА РасчетыПланОплат.КОплатеОстаток 
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                          КАК ПлановаяОплатаКредит,
		|		ВЫБОР 
		|			КОГДА РасчетыПланОплат.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДатаОтчета,ДЕНЬ)
		|				ТОГДА РасчетыПланОплат.КОплатеОстаток
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                                          КАК ПлановаяОплатаПросрочено,
		|		0                                                              КАК Оплачивается,
		|		
		|		0                                                              КАК ПлановаяОтгрузка,
		|		0                                                              КАК ПлановаяОтгрузкаПросрочено,
		|		0                                                              КАК Отгружается
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПланОплат.Остатки(&ДатаОтчетаГраница) КАК РасчетыПланОплат
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		|				ПО РасчетыПланОплат.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		|	ГДЕ
		|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|	{ГДЕ
		|		АналитикаУчета.Организация.* КАК Организация,
		|		АналитикаУчета.Партнер.* КАК Партнер,
		|		АналитикаУчета.Контрагент.* КАК Контрагент,
		|		АналитикаУчета.Договор.* КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		|		(АналитикаУчета.Партнер В
		|				(ВЫБРАТЬ
		|					ОтборПоСегментуПартнеров.Партнер
		|				ИЗ
		|					ОтборПоСегментуПартнеров
		|				ГДЕ
		|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АналитикаУчета.Организация                  КАК Организация,
		|		АналитикаУчета.Партнер                      КАК Партнер,
		|		АналитикаУчета.Контрагент                   КАК Контрагент,
		|		АналитикаУчета.Договор                      КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности      КАК НаправлениеДеятельности,
		|		РасчетыПланОтгрузок.ОбъектРасчетов          КАК ОбъектРасчетов,
		|		РасчетыПланОтгрузок.Валюта                  КАК Валюта,
		|		РасчетыПланОтгрузок.ДокументПлан            КАК ДокументПлан,
		|		РасчетыПланОтгрузок.ДатаПлановогоПогашения  КАК ДатаПлановогоПогашения,
		|		РасчетыПланОтгрузок.ДатаВозникновения       КАК ДатаВозникновения,
		|		0                                           КАК НашДолг,
		|		0                                           КАК ДолгКлиента,
		|		0                                           КАК ДолгКлиентаПросрочено,
		|		
		|		0                                           КАК ПлановаяОплатаАванс,
		|		0                                           КАК ПлановаяОплатаПредоплата,
		|		0                                           КАК ПлановаяОплатаКредит,
		|		0                                           КАК ПлановаяОплатаПросрочено,
		|		0                                           КАК Оплачивается,
		|		
		|		РасчетыПланОтгрузок.СуммаОстаток            КАК ПлановаяОтгрузка,
		|		ВЫБОР 
		|			КОГДА РасчетыПланОтгрузок.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДатаОтчета,ДЕНЬ)
		|				ТОГДА РасчетыПланОтгрузок.СуммаОстаток
		|			ИНАЧЕ 0 
		|		КОНЕЦ                                       КАК ПлановаяОтгрузкаПросрочено,
		|		0                                           КАК Отгружается
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Остатки(&ДатаОтчетаГраница) КАК РасчетыПланОтгрузок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		|				ПО РасчетыПланОтгрузок.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		|	ГДЕ
		|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|	{ГДЕ
		|		АналитикаУчета.Организация.* КАК Организация,
		|		АналитикаУчета.Партнер.* КАК Партнер,
		|		АналитикаУчета.Контрагент.* КАК Контрагент,
		|		АналитикаУчета.Договор.* КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		|		(АналитикаУчета.Партнер В
		|				(ВЫБРАТЬ
		|					ОтборПоСегментуПартнеров.Партнер
		|				ИЗ
		|					ОтборПоСегментуПартнеров
		|				ГДЕ
		|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АналитикаУчета.Организация             КАК Организация,
		|		АналитикаУчета.Партнер                 КАК Партнер,
		|		АналитикаУчета.Контрагент              КАК Контрагент,
		|		АналитикаУчета.Договор                 КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|		РасчетыСКлиентами.ОбъектРасчетов       КАК ОбъектРасчетов,
		|		РасчетыСКлиентами.Валюта               КАК Валюта,
		|		Неопределено                           КАК ДокументПлан,
		|		ДАТАВРЕМЯ(1,1,1)                       КАК ДатаПлановогоПогашения,
		|		ДАТАВРЕМЯ(1,1,1)                       КАК ДатаВозникновения,
		|		0                                      КАК НашДолг,
		|		0                                      КАК ДолгКлиента,
		|		0                                      КАК ДолгКлиентаПросрочено,
		|		
		|		0                                      КАК ПлановаяОплатаАванс,
		|		0                                      КАК ПлановаяОплатаПредоплата,
		|		0                                      КАК ПлановаяОплатаКредит,
		|		0                                      КАК ПлановаяОплатаПросрочено,
		|		РасчетыСКлиентами.ОплачиваетсяОстаток  КАК Оплачивается,
		|		
		|		0                                      КАК ПлановаяОтгрузка,
		|		0                                      КАК ПлановаяОтгрузкаПросрочено,
		|		РасчетыСКлиентами.ОтгружаетсяОстаток   КАК Отгружается
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентами.Остатки(&ДатаОтчетаГраница) КАК РасчетыСКлиентами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		|			ПО АналитикаУчета.КлючАналитики = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
		|	ГДЕ
		|		АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|	{ГДЕ
		|		АналитикаУчета.Организация.* КАК Организация,
		|		АналитикаУчета.Партнер.* КАК Партнер,
		|		АналитикаУчета.Контрагент.* КАК Контрагент,
		|		АналитикаУчета.Договор.* КАК Договор,
		|		АналитикаУчета.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
		|		(АналитикаУчета.Партнер В
		|				(ВЫБРАТЬ
		|					ОтборПоСегментуПартнеров.Партнер
		|				ИЗ
		|					ОтборПоСегментуПартнеров
		|				ГДЕ
		|					ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров))}) КАК Расчеты
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.Организация,
		|	Расчеты.Партнер,
		|	Расчеты.Контрагент,
		|	Расчеты.Договор,
		|	Расчеты.НаправлениеДеятельности,
		|	Расчеты.ОбъектРасчетов,
		|	Расчеты.Валюта,
		|	Расчеты.РасчетныйДокумент,
		|	Расчеты.ДатаПлановогоПогашения,
		|	Расчеты.ДатаВозникновения
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.Организация                КАК Организация,
		|	Расчеты.Партнер                    КАК Партнер,
		|	Расчеты.Контрагент                 КАК Контрагент,
		|	Расчеты.Договор                    КАК Договор,
		|	Расчеты.НаправлениеДеятельности    КАК НаправлениеДеятельности,
		|	Расчеты.ОбъектРасчетов             КАК ОбъектРасчетов,
		|	Расчеты.Валюта                     КАК Валюта,
		|	Расчеты.РасчетныйДокумент          КАК РасчетныйДокумент,
		|	Расчеты.ДатаПлановогоПогашения     КАК ДатаПлановогоПогашения,
		|	Расчеты.ДатаВозникновения          КАК ДатаВозникновения,
		|	Расчеты.НашДолг                    КАК НашДолг,
		|	Расчеты.ДолгКлиента                КАК ДолгКлиента,
		|	Расчеты.ДолгКлиентаПросрочено      КАК ДолгКлиентаПросрочено,
		|	
		|	Расчеты.ПлановаяОплатаАванс        КАК ПлановаяОплатаАванс,
		|	Расчеты.ПлановаяОплатаПредоплата   КАК ПлановаяОплатаПредоплата,
		|	Расчеты.ПлановаяОплатаКредит       КАК ПлановаяОплатаКредит,
		|	Расчеты.ПлановаяОплатаПросрочено   КАК ПлановаяОплатаПросрочено,
		|	Расчеты.Оплачивается               КАК Оплачивается,
		|	
		|	Расчеты.ПлановаяОтгрузка           КАК ПлановаяОтгрузка,
		|	Расчеты.ПлановаяОтгрузкаПросрочено КАК ПлановаяОтгрузкаПросрочено,
		|	Расчеты.Отгружается                КАК Отгружается,
		|
		|	ЕСТЬNULL(Договоры.ЗапрещаетсяПросроченнаяЗадолженность, ЛОЖЬ) КАК ЗапрещаетсяПросроченнаяЗадолженность,
		|	ЕСТЬNULL(Договоры.ОграничиватьСуммуЗадолженности, ЛОЖЬ)       КАК ОграничиватьСуммуЗадолженности,
		|	ЕСТЬNULL(Договоры.ДопустимаяСуммаЗадолженности, 0)            КАК ДопустимаяСуммаЗадолженности
		|
		|ИЗ ВтРасчеты КАК Расчеты
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ПО Договоры.Ссылка = Расчеты.Договор
		|";
		
	конецесли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НаДату","&ДатаОтчета");
	
	Возврат ТекстЗапроса;
КонецФункции

Процедура ИзменитьВычисляемоеПоле(СхемаКомпоновкиДанных,вариант)
	если типзнч(вариант.ДополнительныеСвойства)=тип("Структура") и вариант.ДополнительныеСвойства.КлючВарианта="ЗадолженностьКлиентовПричиныЗапретаОтгрузки"  тогда
		СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ОстатокДопустимойЗадолженности").Выражение="ВЫЧИСЛИТЬВЫРАЖЕНИЕ(""ДопустимаяСуммаЗадолженности -СУММА(ДолгКлиента - НашДолг+Отгружается)"",,,""Первая"",""Текущая"")";
	иначе
		СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ОстатокДопустимойЗадолженности").Выражение="ДопустимаяСуммаЗадолженности - (ДолгКлиента - НашДолг)";
		СхемаКомпоновкиДанных.ПоляИтога.Удалить(СхемаКомпоновкиДанных.ПоляИтога.Найти("ОстатокДопустимойЗадолженности"));
	конецесли;


КонецПроцедуры

#КонецЕсли
